apps/api/app/models/order_command.rb

	def fill_in_id

		self.update_column(:order_id, self.id)
---
UPDATE "order_commands" SET "order_id" = $1 WHERE "order_commands"."id" = $2  [["order_id", 9], ["id", 9]]