apps/api/app/graphql/mutations/orders/create_order.rb

INSERT INTO "order_commands" ("command_name", "payload", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
---
		def create_order(**args)

			order = Domain::Order.new(sanitize(args))

			if order.valid?

				order_command = OrderCommand.new(build_args(order))
				order_command.save